In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'color':['blue','green','yellow','red','white'],
       'object':['ball','pen','pencil','paper','mug'],
       'price':[1.2,1.0,0.6,0.9,1.7]}
frame = pd.DataFrame(data)
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [5]:
frame2 = pd.DataFrame(data, columns=['object','price'])
frame2

   object  price
0    ball    1.2
1     pen    1.0
2  pencil    0.6
3   paper    0.9
4     mug    1.7

In [6]:
frame2 = pd.DataFrame(data,index=['one','two','three','four','five'])
frame2

        color  object  price
one      blue    ball    1.2
two     green     pen    1.0
three  yellow  pencil    0.6
four      red   paper    0.9
five    white     mug    1.7

In [7]:
frame3 = pd.DataFrame(np.arange(16).reshape((4,4)), index=['red','blue','yellow','white'],
                      columns=['ball','pen','pencil','paper'])
frame3

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [8]:
frame3.columns

Index([u'ball', u'pen', u'pencil', u'paper'], dtype='object')

In [9]:
frame3.index

Index([u'red', u'blue', u'yellow', u'white'], dtype='object')

In [11]:
frame3.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [12]:
frame3.ball

red        0
blue       4
yellow     8
white     12
Name: ball, dtype: int64

In [13]:
frame3['ball']

red        0
blue       4
yellow     8
white     12
Name: ball, dtype: int64

In [15]:
frame3.ix[2]

/home/minzhang/anaconda2/envs/pda/lib/python2.7/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

ball       8
pen        9
pencil    10
paper     11
Name: yellow, dtype: int64

In [17]:
frame3.loc['yellow']

ball       8
pen        9
pencil    10
paper     11
Name: yellow, dtype: int64

In [18]:
frame3.iloc[2]

ball       8
pen        9
pencil    10
paper     11
Name: yellow, dtype: int64

In [19]:
frame3.ix[[0,2]]

/home/minzhang/anaconda2/envs/pda/lib/python2.7/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

        ball  pen  pencil  paper
red        0    1       2      3
yellow     8    9      10     11

In [20]:
frame3.iloc[[0,2]]

        ball  pen  pencil  paper
red        0    1       2      3
yellow     8    9      10     11

In [21]:
frame3.loc[['red','yellow']]

        ball  pen  pencil  paper
red        0    1       2      3
yellow     8    9      10     11

In [31]:
frame3[0:3]

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11

In [46]:
frame3.columns.name = 'item'
frame3.index.name = 'id'
frame3

item    ball  pen  pencil  paper
id
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [48]:
frame3['new'] = 12
frame3

item    ball  pen  pencil  paper  new
id
red        0    1       2      3   12
blue       4    5       6      7   12
yellow     8    9      10     11   12
white     12   13      14     15   12

In [51]:
# notice if the list is incomplete, raise exception,but if list becomes series, no exception will be thrown
frame3['new'] = [1,2,3,4]

In [55]:
ser = pd.Series(np.arange(4))
ser

0    0
1    1
2    2
3    3
dtype: int64

In [61]:
frame['new'] = ser
# frame['new'] = [1,2,3,4] #error
# frame['new'] = [1,2,3,4,5] # no error
frame

    color  object  price  new
0    blue    ball    1.2  0.0
1   green     pen    1.0  1.0
2  yellow  pencil    0.6  2.0
3     red   paper    0.9  3.0
4   white     mug    1.7  NaN

In [77]:
ser = pd.Series(np.arange(5))
ser

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [78]:
frame['new'] = ser
frame

    color  object  price  new
0    blue    ball    1.2    0
1   green     pen    1.0    1
2  yellow  pencil    0.6    2
3     red   paper    0.9    3
4   white     mug    1.7    4

In [72]:
frame.color[1:3]

1     green
2    yellow
Name: color, dtype: object

In [73]:
frame3

item    ball  pen  pencil  paper  new
id
red        0    1       2      3    1
blue       4    5       6      7    2
yellow     8    9      10     11    3
white     12   13      14     15    4

In [75]:
frame3.ball

id
red        0
blue       4
yellow     8
white     12
Name: ball, dtype: int64

In [79]:
frame

    color  object  price  new
0    blue    ball    1.2    0
1   green     pen    1.0    1
2  yellow  pencil    0.6    2
3     red   paper    0.9    3
4   white     mug    1.7    4

In [85]:
frame.isin([1,'pen'])

   color  object  price    new
0  False   False  False  False
1  False    True   True   True
2  False   False  False  False
3  False   False  False  False
4  False   False  False  False

In [86]:
frame[frame.isin([1,'pen'])]

  color object  price  new
0   NaN    NaN    NaN  NaN
1   NaN    pen    1.0  1.0
2   NaN    NaN    NaN  NaN
3   NaN    NaN    NaN  NaN
4   NaN    NaN    NaN  NaN

In [87]:
del frame['new']

In [88]:
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [91]:
frame3[frame3<12]

item    ball  pen  pencil  paper  new
id
red      0.0  1.0     2.0    3.0    1
blue     4.0  5.0     6.0    7.0    2
yellow   8.0  9.0    10.0   11.0    3
white    NaN  NaN     NaN    NaN    4

In [98]:
nestdict = {'red':{2012:22, 2013:33},
                   'white':{2011:13,2012:22,2013:23},
                   'bule':{2011:22}}
frame2 = pd.DataFrame(nestdict)
frame2

      bule   red  white
2011  22.0   NaN     13
2012   NaN  22.0     22
2013   NaN  33.0     23

In [102]:
# you'd better convert the list to service , or you will get an error
nest = {'red':pd.Series([1,2]),
                   'white':pd.Series([2]),
                   'bule':pd.Series([1,2])}
frame10 = pd.DataFrame(nest)
frame10

   bule  red  white
0     1    1    2.0
1     2    2    NaN